In [12]:
import pandas as pd

## 예제 6-9  데이터 그룹화하기

### 새로운 데이터를 읽을 때 전체적으로 확인하면 도움이 되는 기본사항
* shape : 전체 데이터 사이즈 파악
* head() : 샘플 데이터 확인, 컬럼과 인덱스 파악
* count() : 열별 데이터 개수(결측지 확인)
* isnull().sum() : 결측지가 존재한다면 추가 확인
* dtypes : 각 열의 타입확인, 검색을 하는데 추가적인 전처리 작업이 필요한지 파악하기 위해
* tail() : 데이터가 마지막까지 일관성있게 저장되는지 특이사항은 없는지 확인

In [13]:
book_data = pd.read_csv("../data/book_data.csv",encoding='cp949')
book_data.head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
0,올 더 빌딩스 인 런던,제임스 걸리버 핸콕,2018-08-25,"14,400",양장본,140,225*280mm,476,예술/대중문화,책발전소,110
1,렛 잇 블리드,이언 랜킨,2018-08-19,"13,320",반양장본,476,128*188mm,476,소설/시/희곡,오픈하우스,110
2,은유로 사회 읽기,대니얼 리그니,2018-08-20,"39,500",양장본,416,152*223mm,749,사회과학,한울(한울아카데미),10
3,유럽 맥주 여행,백경학,2018-08-24,"14,400",반양장본,308,150*220mm,400,역사,글항아리,10
4,"이게, 행복이 아니면 무엇이지",김혜령,2018-08-20,"13,050",NaN,288,135*200mm,374,인문학,웨일북,10

In [14]:
book_data.shape

(2000, 11)

In [15]:
book_data.count()

book_name         2000
book_writer       2000
book_date         2000
book_price        2000
book_cover        1683
book_page         2000
book_size         1999
book_weight       2000
book_category     2000
book_publisher    2000
sales_point       2000
dtype: int64

In [16]:
book_data.dtypes

book_name         object
book_writer       object
book_date         object
book_price        object
book_cover        object
book_page         object
book_size         object
book_weight        int64
book_category     object
book_publisher    object
sales_point       object
dtype: object

In [17]:
book_data.isnull().sum()

book_name           0
book_writer         0
book_date           0
book_price          0
book_cover        317
book_page           0
book_size           1
book_weight         0
book_category       0
book_publisher      0
sales_point         0
dtype: int64

In [18]:
book_data.tail()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
1995,여기는 함께섬 정치를 배웁니다,최승필,2018-06-01,"10,800",반양장본,136,175*240mm,258,어린이,천개의바람,770
1996,"아빠, 이런 여행 어때?",김동옥,2018-05-30,"13,500",반양장본,344,130*188mm,453,여행,씽크스마트,"2,555"
1997,생각의 힘,이나모리 가즈오,2018-06-15,"12,600",양장본,192,128*188mm,327,자기계발,한국경제신문,"1,305"
1998,양자 역학이란 무엇인가,마이클 워커,2018-06-04,"19,800",반양장본,488,152*224mm,730,과학,처음북스(구 빅슨북스),915
1999,지옥사원 2,네온비,2018-05-30,"10,800",반양장본,260,148*210mm,423,만화,위즈덤하우스,705

1961행에 특이값이 있음  
행별 특이사항을 찾는 과정에서 검출한 데이터라고 가정

In [20]:
book_data.book_date.max()

'초판출간 2008년'

In [21]:
book_data.book_date.replace('초판출간 2008년','2018-01-01',inplace = True)
book_data.book_date.max()

'2018-09-28'

위에서 확인한 결측치는 회의결과 다수의 값으로 채우기로 결정났다고 가정한다.  
book_cover, book_size

In [22]:
book_data.book_cover.value_counts()

반양장본    1236
양장본      447
Name: book_cover, dtype: int64

In [23]:
book_data.book_cover.fillna('반양장본',inplace = True)

In [24]:
book_data.book_size.value_counts().head()

128*188mm    146
148*210mm    129
152*223mm    106
152*225mm    105
140*210mm     68
Name: book_size, dtype: int64

In [25]:
book_data.book_size.fillna('128*188mm',inplace = True)

In [26]:
book_data.count()

book_name         2000
book_writer       2000
book_date         2000
book_price        2000
book_cover        2000
book_page         2000
book_size         2000
book_weight       2000
book_category     2000
book_publisher    2000
sales_point       2000
dtype: int64

출판사 빈도가 어떻게 되는지 확인

In [28]:
book_data.book_publisher.head(30)

0              책발전소
1             오픈하우스
2        한울(한울아카데미)
3              글항아리
4               웨일북
5              사월의책
6             한겨레출판
7              세종서적
8     영컴(YOUNG COM)
9                 클
10      스콜라(위즈덤하우스)
11             북스토리
12               알마
13            한겨레출판
14              이데아
15             열린책들
16             열린책들
17               비채
18              사파리
19          좋은친구출판사
20            삼호ETM
21              아카넷
22              성안당
23            스마트베어
24             스윙밴드
25               까치
26             성안북스
27            천년의상상
28             은행나무
29             문학동네
Name: book_publisher, dtype: object

몇개의 데이터로 범주가 이루어지지 않음을 확인

In [29]:
book_data.book_publisher.value_counts().head()

위즈덤하우스          41
민음사             33
문학동네            28
창비              19
알에이치코리아(RHK)    17
Name: book_publisher, dtype: int64

총 887개의 출판사가 있음을 확인

In [30]:
book_data.book_publisher.value_counts().shape

(887,)

수치형 데이터도 중복 발생할 수 있음

In [31]:
book_data.book_price.value_counts().head()

13,500    221
10,800    188
11,700    170
14,400    149
12,600    122
Name: book_price, dtype: int64

마찬가지로 유형의 개수를 파악할 수 있음

In [32]:
book_data.book_price.value_counts().shape

(171,)

In [34]:
book_data_gr = book_data.groupby('book_price')

In [35]:
type(book_data_gr)

pandas.core.groupby.generic.DataFrameGroupBy

ngroups 속성을 통해 groupby된 유형의 개수 확인

In [36]:
book_data_gr.ngroups

171

In [37]:
type(book_data_gr.groups)

pandas.io.formats.printing.PrettyDict

In [38]:
book_data_gr.groups.keys()

dict_keys(['10,080', '10,260', '10,350', '10,450', '10,620', '10,710', '10,800', '11,160', '11,250', '11,400', '11,520', '11,700', '11,760', '112,100', '12,000', '12,150', '12,330', '12,350', '12,420', '12,510', '12,600', '12,750', '12,780', '12,870', '13,000', '13,050', '13,110', '13,300', '13,320', '13,410', '13,440', '13,500', '13,950', '14,000', '14,220', '14,250', '14,400', '14,850', '15,000', '15,120', '15,210', '15,300', '15,750', '16,000', '16,020', '16,110', '16,200', '16,500', '16,650', '16,920', '17,010', '17,100', '17,550', '17,820', '18,000', '18,530', '18,900', '19,000', '19,200', '19,620', '19,800', '20,000', '20,250', '20,700', '21,420', '21,600', '21,960', '22,000', '22,050', '22,500', '22,900', '220,000', '23,100', '23,400', '23,750', '24,000', '24,300', '24,500', '25,000', '25,200', '25,650', '25,900', '26,100', '26,600', '26,820', '27,000', '27,270', '27,550', '27,900', '28,000', '28,500', '28,800', '288,000', '29,000', '29,500', '29,520', '29,700', '297,000', '3,000', '3,510', '30,400', '30,600', '31,500', '32,220', '32,400', '33,000', '33,300', '34,200', '35,100', '36,000', '36,450', '38,700', '39,420', '39,500', '4,000', '4,410', '4,500', '4,900', '4,950', '40,000', '40,500', '40,850', '42,750', '43,200', '44,100', '45,000', '45,600', '45,900', '47,700', '48,600', '49,500', '5,250', '5,310', '5,400', '5,850', '5,950', '50,350', '52,200', '53,100', '54,000', '58,000', '6,120', '6,300', '6,720', '6,750', '63,900', '64,800', '7,000', '7,020', '7,200', '7,650', '7,920', '72,000', '75,600', '78,300', '8,010', '8,100', '8,400', '8,550', '8,820', '8,910', '81,000', '88,200', '9,000', '9,100', '9,450', '9,500', '9,520', '9,720', '9,810', '9,900'])

가격이 10,080원의 책의 인덱스 반환

In [39]:
book_data_gr.groups['10,080']

Int64Index([27, 49, 76, 541, 651, 802, 1339], dtype='int64')

In [40]:
book_data_gr.groups['10,080'].size

7

get_group() 함수를 통해 서브셋 검색

In [41]:
book_data_gr.get_group('10,080').head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
27,알록달록,정여울,2018-08-16,"10,080",반양장본,168,128*188mm,168,에세이,천년의상상,480
49,생각이 만든 감옥,맨리 P. 홀,2018-08-20,"10,080",반양장본,208,128*188mm,208,인문학,마름돌,"1,350"
76,1984,조지 오웰,2018-08-20,"10,080",반양장본,428,135*210mm,556,소설/시/희곡,더디,160
541,첫 문장,윤성희,2018-07-25,"10,080",양장본,152,104*182mm,234,소설/시/희곡,현대문학,"1,850"
651,"야옹아, 내가 집사라도 괜찮을까?",마담툰,2018-07-19,"10,080",반양장본,176,140*200mm,232,만화,네오카툰,630

In [42]:
book_data.sales_point.dtype

dtype('O')

In [43]:
book_weight = book_data.book_weight
book_weight

0       476
1       476
2       749
3       400
4       374
       ...
1995    258
1996    453
1997    327
1998    730
1999    423
Name: book_weight, Length: 2000, dtype: int64

모든 행(i)의 마지막 열(-1)을 대상으로 ',' 문자를 제거

In [44]:
for i in range(0,2000):
    a = book_data.iloc[i,-1].replace(',','')
    book_data.iloc[i,-1] = a

In [45]:
book_data_gr.get_group('10,080').head(2)

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
27,알록달록,정여울,2018-08-16,"10,080",반양장본,168,128*188mm,168,에세이,천년의상상,480
49,생각이 만든 감옥,맨리 P. 홀,2018-08-20,"10,080",반양장본,208,128*188mm,208,인문학,마름돌,1350

In [46]:
book_data.sales_point = book_data.sales_point.astype('float64')
book_data.sales_point.dtype

dtype('float64')

In [47]:
book_data.book_weight.dtype

dtype('int64')

In [48]:
book_data.head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
0,올 더 빌딩스 인 런던,제임스 걸리버 핸콕,2018-08-25,"14,400",양장본,140,225*280mm,476,예술/대중문화,책발전소,110.0
1,렛 잇 블리드,이언 랜킨,2018-08-19,"13,320",반양장본,476,128*188mm,476,소설/시/희곡,오픈하우스,110.0
2,은유로 사회 읽기,대니얼 리그니,2018-08-20,"39,500",양장본,416,152*223mm,749,사회과학,한울(한울아카데미),10.0
3,유럽 맥주 여행,백경학,2018-08-24,"14,400",반양장본,308,150*220mm,400,역사,글항아리,10.0
4,"이게, 행복이 아니면 무엇이지",김혜령,2018-08-20,"13,050",반양장본,288,135*200mm,374,인문학,웨일북,10.0

그룹화 한 결과를 특정 열별로 통계함수를 적용

In [49]:
book_data.groupby('book_cover').agg({'book_name':'count',
                                     'sales_point':'mean', 
                                     'book_weight':'mean'})

            book_name  sales_point  book_weight
book_cover
반양장본             1553  3522.652930   494.649066
양장본               447  4171.825503   582.709172

In [50]:
book_new = book_data.groupby('book_date').agg({'book_name':'count',
                                     'sales_point':'mean', 
                                     'book_weight':'mean'})
book_new.head(10)

            book_name  sales_point  book_weight
book_date
2018-01-01          1        310.0        513.0
2018-03-20          1      42477.0        416.0
2018-03-23          1         80.0        408.0
2018-04-01          1        140.0        406.0
2018-04-10          1        150.0       1719.0
2018-04-20          1        255.0        291.0
2018-04-25          1        395.0        246.0
2018-04-30          1         75.0        543.0
2018-05-01          2        515.0        306.5
2018-05-04          1        315.0        577.0

분석 결과에 맞게 열 이름 변경

In [51]:
book_new.columns = ['book_count','sales_point_평균', 'book_weight_평균']
book_new.head()

            book_count  sales_point_평균  book_weight_평균
book_date
2018-01-01           1           310.0           513.0
2018-03-20           1         42477.0           416.0
2018-03-23           1            80.0           408.0
2018-04-01           1           140.0           406.0
2018-04-10           1           150.0          1719.0

In [52]:
book_new.nlargest(5,columns = 'book_count')

            book_count  sales_point_평균  book_weight_평균
book_date
2018-07-20         101     2936.079208      531.326733
2018-06-20          90     6455.222222      488.522222
2018-06-15          89     3370.337079      541.022472
2018-06-25          89     8031.067416      552.314607
2018-07-25          70     2968.285714      476.857143

In [53]:
book_new.nsmallest(5,columns = 'book_count')

            book_count  sales_point_평균  book_weight_평균
book_date
2018-01-01           1           310.0           513.0
2018-03-20           1         42477.0           416.0
2018-03-23           1            80.0           408.0
2018-04-01           1           140.0           406.0
2018-04-10           1           150.0          1719.0

## 예제 6-10 여러개 열을 그룹화하기

In [54]:
group_cols = ['book_date','book_cover']
group_cols

['book_date', 'book_cover']

In [55]:
agg_cols=['sales_point','book_weight']
agg_cols

['sales_point', 'book_weight']

수치형 데이터여야 가능

In [56]:
fg = book_data.groupby(group_cols)[agg_cols].agg(['sum','mean','size'])
fg.head()

                      sales_point               book_weight
                              sum     mean size         sum    mean size
book_date  book_cover
2018-01-01 반양장본             310.0    310.0    1         513   513.0    1
2018-03-20 반양장본           42477.0  42477.0    1         416   416.0    1
2018-03-23 양장본               80.0     80.0    1         408   408.0    1
2018-04-01 반양장본             140.0    140.0    1         406   406.0    1
2018-04-10 양장본              150.0    150.0    1        1719  1719.0    1

In [57]:
level1 = fg.columns.get_level_values(0)
level1

Index(['sales_point', 'sales_point', 'sales_point', 'book_weight',
       'book_weight', 'book_weight'],
      dtype='object')

In [58]:
level2 = fg.columns.get_level_values(1)
level2

Index(['sum', 'mean', 'size', 'sum', 'mean', 'size'], dtype='object')

In [59]:
fg.columns = level1+'_'+level2
fg.head()

,,sales_point_sum,sales_point_mean,sales_point_size,book_weight_sum,book_weight_mean,book_weight_size
book_date,book_cover,,,,,,
2018-01-01,반양장본,310.0,310.0,1,513,513.0,1
2018-03-20,반양장본,42477.0,42477.0,1,416,416.0,1
2018-03-23,양장본,80.0,80.0,1,408,408.0,1
2018-04-01,반양장본,140.0,140.0,1,406,406.0,1
2018-04-10,양장본,150.0,150.0,1,1719,1719.0,1

## 예제 6-11 그룹화 처리 비교하기

select book_date,count(*)from book_data group by book_date;

In [61]:
book_data.groupby('book_date').size().head()

book_date
2018-01-01    1
2018-03-20    1
2018-03-23    1
2018-04-01    1
2018-04-10    1
dtype: int64

In [62]:
book_data.groupby('book_date').count().head()

,book_name,book_writer,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
book_date,,,,,,,,,,
2018-01-01,1,1,1,1,1,1,1,1,1,1
2018-03-20,1,1,1,1,1,1,1,1,1,1
2018-03-23,1,1,1,1,1,1,1,1,1,1
2018-04-01,1,1,1,1,1,1,1,1,1,1
2018-04-10,1,1,1,1,1,1,1,1,1,1

In [63]:
book_data.groupby('book_date')['sales_point'].count().head()

book_date
2018-01-01    1
2018-03-20    1
2018-03-23    1
2018-04-01    1
2018-04-10    1
Name: sales_point, dtype: int64

select book_date,avg('sales_point'),count(*) from book_data group by book_date;

In [64]:
import numpy as np

In [65]:
book_data.groupby('book_date').agg({'sales_point': np.mean, 
                                    'book_date': np.size}).head()

            sales_point  book_date
book_date
2018-01-01        310.0          1
2018-03-20      42477.0          1
2018-03-23         80.0          1
2018-04-01        140.0          1
2018-04-10        150.0          1

select book_date,book_cover,count(*),avg(sales_point) from book_data group by book_date,book_cover;

In [66]:
book_data.groupby(['book_date','book_cover']).agg({'sales_point': [np.size,np.mean]}).head()

                      sales_point
                             size     mean
book_date  book_cover
2018-01-01 반양장본                 1    310.0
2018-03-20 반양장본                 1  42477.0
2018-03-23 양장본                  1     80.0
2018-04-01 반양장본                 1    140.0
2018-04-10 양장본                  1    150.0